
&ЗначениеНастройки
Перем ПростаяНастройка Экспорт;

&ЗначениеНастройки("Настройки.ОченьХитраяНастройка")
Перем ХитраяНастройка Экспорт;

&ЗначениеНастройки
Перем МассивНастроек Экспорт;

&ЗначениеНастройки(ЗначениеПоУмолчанию = 123)
Перем ЧисловаяНастройка Экспорт;

Перем НеЭкспортнаяЧисловаяНастройка;

Функция ЧисловаяНастройка() Экспорт
	Возврат НеЭкспортнаяЧисловаяНастройка;
КонецФункции

&Компонент
Процедура ПриСозданииОбъекта(
	// &ЗначениеНастройки(ЗначениеПоУмолчанию = 123) ЧисловаяНастройка
	&Деталька(ЗначениеПоУмолчанию = 123) ЧисловаяНастройка
)
	НеЭкспортнаяЧисловаяНастройка = ЧисловаяНастройка;
КонецПроцедуры