&Внедряемое("КомпонентНижнегоУровня")
Перем ВнедряемыйКомпонентНижнегоУровня Экспорт;

&Внедряемое
Перем КомпонентНижнегоУровня Экспорт;

Перем КомпонентВКонструкторе Экспорт;

Перем ВнедряемыйЧерезСеттер;


&Внедряемое
Процедура УстановитьКомпонентНижнегоУровня(Значение) Экспорт
	ВнедряемыйЧерезСеттер = Значение;	
КонецПроцедуры

Функция ПолучитьКомпонентНижнегоУровня() Экспорт

	Возврат ВнедряемыйЧерезСеттер;
	
КонецФункции

&Компонент
Процедура ПриСозданииОбъекта(&Внедряемое("КомпонентНижнегоУровня") _КомпонентНижнегоУровня)
	КомпонентВКонструкторе = _КомпонентНижнегоУровня;
КонецПроцедуры