#Использовать autumn
#Использовать asserts
#Использовать ".."
#Использовать "."

Перем Поделка;

Процедура ПередЗапускомТеста() Экспорт
	ПроинициализироватьПоделку();
КонецПроцедуры

Процедура ПроинициализироватьПоделку()
	Если Поделка = Неопределено Тогда	
		Поделка = ПолучитьПоделку();
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьПоделку()

	Каталог = ОбъединитьПути(ТекущийКаталог(), "tests", "Классы");
	Поделка = Новый Поделка();
	Поделка.ПросканироватьКаталог(Каталог);	
	Поделка.ЗапуститьПриложение();

	Возврат Поделка;
КонецФункции

&Тест
Процедура СоздаетсяПростойКомпонент() Экспорт
	// Дано
	
	// Когда
	Компонент = Поделка.НайтиЖелудь("КомпонентНижнегоУровня");

	// Тогда
	Ожидаем.Что(Компонент).Не_().Равно(Неопределено);
КонецПроцедуры

&Тест
Процедура ОсуществляетсяВнедрениеКомпонента() Экспорт
	// Дано
	
	// Когда
	Компонент = Поделка.НайтиЖелудь("КомпонентВерхнегоУровня");

	// Тогда
	Ожидаем.Что(Компонент.ВнедряемыйКомпонентНижнегоУровня).Не_().Равно(Неопределено);
	Ожидаем.Что(Компонент.КомпонентНижнегоУровня).Не_().Равно(Неопределено);
	Ожидаем.Что(Компонент.ПолучитьКомпонентНижнегоУровня()).Не_().Равно(Неопределено);

КонецПроцедуры

&Тест
Процедура ВнедряетсяМассивФабричнымМетодом() Экспорт
	// Дано
	
	// Когда
	Компонент = Поделка.НайтиЖелудь("КомпонентСМассивом");

	// Тогда
	Ожидаем.Что(Компонент.МассивИзДвухЭлементов).ИмеетТип(Тип("Массив"));
	Ожидаем.Что(Компонент.МассивИзДвухЭлементов.Количество()).Равно(2);
КонецПроцедуры

&Тест
Процедура СоздаетсяКомпонентСКостомнымИменем() Экспорт
	// Дано
	
	// Когда
	Компонент = Поделка.НайтиЖелудь("КомпонентСКостомнымИменем");

	// Тогда
	Ожидаем.Что(Компонент).Не_().Равно(Неопределено);
КонецПроцедуры

&Тест
Процедура СоздаетсяОбычныйПрототип() Экспорт
	// Дано
	
	// Когда
	Компонент1 = Поделка.НайтиЖелудь("ОбычныйПрототип");
	Компонент2 = Поделка.НайтиЖелудь("ОбычныйПрототип");

	// Тогда
	Ожидаем.Что(Компонент1).Не_().Равно(Неопределено);
	Ожидаем.Что(Компонент2).Не_().Равно(Неопределено);
	Ожидаем.Что(Компонент1).Не_().Равно(Компонент2);
КонецПроцедуры

&Тест
Процедура СоздаетсяПрототипСКостомнымИмененм() Экспорт
	// Дано
	
	// Когда
	Компонент1 = Поделка.НайтиЖелудь("ПрототипСКостомнымИмененм");
	Компонент2 = Поделка.НайтиЖелудь("ПрототипСКостомнымИмененм");

	// Тогда
	Ожидаем.Что(Компонент1).Не_().Равно(Неопределено);
	Ожидаем.Что(Компонент2).Не_().Равно(Неопределено);
	Ожидаем.Что(Компонент1).Не_().Равно(Компонент2);
КонецПроцедуры

&Тест
Процедура СоздаетсяКомпонентПоСинониму() Экспорт
	// Дано
	
	// Когда
	Компонент = Поделка.НайтиЖелудь("УникальныйКомпонент");

	// Тогда
	Ожидаем.Что(Компонент).Не_().Равно(Неопределено);
КонецПроцедуры