#Использовать autumn
#Использовать asserts
#Использовать ".."
#Использовать "."

Функция ПостроитьПоделку()

	Поделка = Новый Поделка();
	Поделка.ЗапуститьПриложение();

	Возврат Поделка;

КонецФункции

&Тест
Процедура ОтключениеВсехОбработчиковБлокируетВнедрение() Экспорт
	// Дано

	// Когда
	Компонент = ПостроитьПоделку().НайтиЖелудь("КомпонентСОтключеннойОбработкой");

	// Тогда
	Ожидаем.Что(Компонент, "Компонент с отключённой обработкой должен создаваться")
		.Не_().Равно(Неопределено);
	Ожидаем.Что(Компонент.ВнедренныйКомпонент, "При отключении всех обработчиков внедрение не выполняется")
		.Равно(Неопределено);
КонецПроцедуры

&Тест
Процедура ОтключениеНазванногоОбработчикаБлокируетВнедрение() Экспорт
	// Дано

	// Когда
	Компонент = ПостроитьПоделку().НайтиЖелудь("КомпонентСИзбирательнойОбработкой");

	// Тогда
	Ожидаем.Что(Компонент.ВнедренныйКомпонент, "Названный обработчик применяться не должен")
		.Равно(Неопределено);
КонецПроцедуры
