#Использовать autumn
#Использовать asserts
#Использовать ".."
#Использовать "."

Функция ПостроитьПоделку()

	Поделка = Новый Поделка();
	Поделка
		.ДобавитьЗаготовку(Тип("ИнициализаторТестов"))
		.ЗапуститьПриложение();

	Возврат Поделка;

КонецФункции

&Тест
Процедура ФазаИнициализацииОтключаетНапильники() Экспорт
	// Дано

	// Когда
	Компонент = ПостроитьПоделку().НайтиЖелудь("КомпонентФазыИнициализации");

	// Тогда
	Ожидаем.Что(Компонент, "Компонент фазы инициализации должен создаваться")
		.Не_().Равно(Неопределено);
	Ожидаем.Что(Компонент.ВнедренныйКомпонент, "На фазе инициализации напильники не применяются")
		.Равно(Неопределено);
КонецПроцедуры
