// Пометка, что внедряемая зависимость внедряется не непосредственно, а через специальный объект-контейнер,
// который позволяет получить зависимость программно и отложенно.
//
// Может использоваться для внедрения прототипов, внедрения компонента самого в себя, для разрыва циклических
// зависимостей, для передачи дополнительных параметров внедряемого компонента и т.п.
//
// Используется совместно с аннотациями `&Внедряемое` и `&ЗначениеНастройки`.
//
// Примечание: данная аннотация - «душный» псевдоним аннотации `&Табакерка` фреймворка autumn.
// Актуальную документацию см. в autumn: https://github.com/autumn-library/autumn
//
// Пример:
// &Контейнер
// &Внедряемое("ДругойКомпонент")
// Перем КонтейнерСДругимКомпонентом;
//
&Аннотация("Контейнер")
&Табакерка
Процедура ПриСозданииОбъекта()

КонецПроцедуры
