// Помечает компонент как имеющий приоритет среди других компонентов с таким же именем или квалификатором.
// В случае конфликта имён при получении компонентов или их регистрации будет использован компонент
// с аннотацией `&Приоритетный`.
//
// При наличии нескольких компонентов с одним и тем же квалификатором позволяет определить, какой из них
// следует возвращать при поиске конкретного компонента по его квалификатору.
//
// Если несколько компонентов с одним и тем же именем/квалификатором имеют аннотацию `&Приоритетный`,
// будет вызвано исключение.
//
// Размещается над определением компонента - конструктором или фабричным методом.
//
// Примечание: данная аннотация - «душный» псевдоним аннотации `&Верховный` фреймворка autumn.
// Актуальную документацию см. в autumn: https://github.com/autumn-library/autumn
//
// Пример:
// &Приоритетный
// &Компонент("ПереопределяемыйКомпонент")
// Процедура ПриСозданииОбъекта()
// КонецПроцедуры
//
&Аннотация("Приоритетный")
&Верховный
Процедура ПриСозданииОбъекта()

КонецПроцедуры
