// Аннотация для указания жизненного цикла приложения, начиная с которого разрешено создавать компонент.
//
// По умолчанию все компоненты имеют фазу "Выполнение", означающую, что компонент может быть создан только
// после запуска приложения.
//
// К компонентам с фазой "Инициализация" не применяются обработчики компонентов.
//
// Размещается над конструктором класса или над фабричным методом.
//
// Параметры:
//   Значение - Строка - Состояние приложения, на котором разрешено создавать компонент.
//
// Пример:
// &ФазаПриложения("Инициализация")
// &Компонент
// Процедура ПриСозданииОбъекта()
// КонецПроцедуры
//
// Примечание: данная аннотация — «душный» псевдоним аннотации `&Спецификация` фреймворка autumn.
// Актуальную документацию см. в autumn: https://github.com/autumn-library/autumn
//
&Аннотация("ФазаПриложения")
&Спецификация
Процедура ПриСозданииОбъекта(&ПсевдонимДля(Аннотация = "Спецификация", Параметр = "Значение") Значение = "Выполнение")

КонецПроцедуры
