// Помечает указанный класс как компонент, жизненным циклом которого управляет фреймворк.
//
// Размещается над конструктором класса.
//
// Примечание: данная аннотация — «душный» псевдоним аннотации `&Желудь` фреймворка autumn.
// Актуальную документацию см. в autumn: https://github.com/autumn-library/autumn
//
// Параметры:
//   Значение - Строка - Имя компонента. По умолчанию будет использовано имя типа объекта,
//                       как оно возвращается функцией `ТипЗнч`.
//
// Пример:
// &Компонент
// Процедура ПриСозданииОбъекта()
// КонецПроцедуры
//
&Аннотация("Компонент")
&Желудь
Процедура ПриСозданииОбъекта(&ПсевдонимДля(Аннотация = "Желудь", Параметр = "Значение") Значение = "")

КонецПроцедуры
