// Маркерная аннотация для указания, что внедряемая зависимость является компонентом.
// Основной способ связывания компонентов между собой.
//
// Может быть использована над параметром конструктора/фабричного метода компонента, полем класса
// или методом установки значения.
//
// Примечание: данная аннотация - «душный» псевдоним аннотации `&Пластилин` фреймворка autumn.
// Актуальную документацию см. в autumn: https://github.com/autumn-library/autumn
//
// Параметры:
//   Значение - Строка - Имя внедряемого компонента. Если не заполнено, используется имя параметра
//                       конструктора/поля класса или часть имени метода для установки значения.
//   Тип - Строка - Тип внедряемого компонента. В случае передачи значения "Желудь" будет внедрён компонент
//                  как таковой. Также может быть указан тип-коллекция: "Массив", "ТаблицаЗначений" и другие.
//                  Полный список доступных типов см. в библиотеке autumn-collections
//                  (https://github.com/autumn-library/autumn-collections).
//   ПроизвольныйПараметр - Произвольный - Повторяемый параметр. Передаваемые во внедряемый компонент
//                                         произвольные значения.
//
// Пример:
// &Компонент
// Процедура ПриСозданииОбъекта(&Внедряемое ДругойКомпонент)
//
&Аннотация("Внедряемое")
&Пластилин
Процедура ПриСозданииОбъекта(&ПсевдонимДля(Аннотация = "Пластилин", Параметр = "Значение") Значение = "", &ПсевдонимДля(Аннотация = "Пластилин", Параметр = "Тип") Тип = "", &Повторяемый &ПсевдонимДля(Аннотация = "Пластилин", Параметр = "Блестяшка") ПроизвольныйПараметр)

КонецПроцедуры
