// Процедуры, помеченные данной аннотацией, будут вызваны в конце инициализации компонента,
// после отработки конструктора/фабричного метода и всех обработчиков, применяемых на компоненте.
// Во время выполнения процедуры доступны все внедряемые зависимости, внедрённые как через конструктор,
// так и через поля класса и методы-сеттеры.
//
// Компонент может содержать несколько процедур, помеченных данной аннотацией.
// Порядок их вызова не гарантируется.
//
// Процедура должна быть помечена как `Экспорт`.
//
// Примечание: данная аннотация - «душный» псевдоним аннотации `&ФинальныйШтрих` фреймворка autumn.
// Актуальную документацию см. в autumn: https://github.com/autumn-library/autumn
//
// Пример:
// &ПослеИнициализацииКомпонента
// Процедура ПостИнициализация() Экспорт
//     Сообщить("Я выполнилась после конструктора объекта");
// КонецПроцедуры
//
&Аннотация("ПослеИнициализацииКомпонента")
&ФинальныйШтрих
Процедура ПриСозданииОбъекта()

КонецПроцедуры
