// Помечает функцию как функцию, создающую компонент.
//
// Может иметь параметры, каждый из которых должен быть промаркирован как `&Внедряемое`, `&ЗначениеНастройки`
// или `&ПроизвольныйПараметр`. В указанные параметры автоматически будут внедрены соответствующие зависимости
// при создании компонента.
//
// Может размещаться над экспортной функцией в классе, проаннотированном как `&Конфигурация`.
//
// Примечание: данная аннотация — «душный» псевдоним аннотации `&Завязь` фреймворка autumn.
// Актуальную документацию см. в autumn: https://github.com/autumn-library/autumn
//
// Параметры:
//   Значение - Строка - Имя создаваемого компонента. По умолчанию будет использовано имя метода.
//   Тип - Строка - Тип создаваемого компонента.
//                  Требуется, если по имени компонента не получается однозначно определить его тип.
//
// Пример:
// &ФабричныйМетод
// Функция ПользовательскийКомпонент(&Внедряемое Зависимость, &ЗначениеНастройки ВажнаяНастройка) Экспорт
//     Возврат Новый ПользовательскийКомпонент(Зависимость, ВажнаяНастройка);
// КонецФункции
//
&Аннотация("ФабричныйМетод")
&Завязь
Процедура ПриСозданииОбъекта(&ПсевдонимДля(Аннотация = "Завязь", Параметр = "Значение") Значение = "", &ПсевдонимДля(Аннотация = "Завязь", Параметр = "Тип") Тип = "")

КонецПроцедуры
