// Специальный тип компонента для обработки определений компонентов.
//
// Аналог обработчика компонента для определения компонента. Срабатывает каждый раз, когда в контекст
// добавляется новое определение компонента. При добавлении самого обработчика в контекст все ранее добавленные
// определения компонентов передаются в него для проверки.
//
// Класс, помеченный данной аннотацией, должен реализовать следующий интерфейс:
// * `Процедура ПриДобавленииОпределенияЖелудя(ОпределениеЖелудя) Экспорт`
//
// Каждый обработчик определения компонента дополнительно является прототипом, имеет квалификатор "Приемка"
// и фазу приложения "Инициализация".
//
// Размещается над конструктором класса.
//
// Параметры:
//   Значение - Строка - Имя компонента, под которым обработчик добавляется в контекст приложения.
//
// Пример:
// &ОбработчикОпределенияКомпонента
// Процедура ПриСозданииОбъекта()
// КонецПроцедуры
//
// Примечание: данная аннотация — «душный» псевдоним аннотации `&Приемка` фреймворка autumn.
// Актуальную документацию см. в autumn: https://github.com/autumn-library/autumn
//
&Аннотация("ОбработчикОпределенияКомпонента")
&Приемка
Процедура ПриСозданииОбъекта(&ПсевдонимДля(Аннотация = "Приемка", Параметр = "Значение") Значение = "")

КонецПроцедуры
