// Специальный тип компонента, автоматически выполняемый при запуске приложения.
//
// Компонент, помеченный данной аннотацией, должен реализовать следующий интерфейс:
// * `Процедура ПриЗапускеПриложения() Экспорт`
//
// Каждый запускатель приложения дополнительно имеет квалификатор "Рогатка".
//
// Запускатель приложения сам по себе тоже является компонентом, то есть может запрашивать внедрение
// зависимостей, является объектом для обработки обработчиками компонентов, может иметь фазу приложения
// и так далее.
//
// Размещается над конструктором класса.
//
// Примечание: данная аннотация - «душный» псевдоним аннотации `&Рогатка` фреймворка autumn.
// Актуальную документацию см. в autumn: https://github.com/autumn-library/autumn
//
// Параметры:
//   Значение - Строка - Имя компонента, под которым запускатель добавляется в контекст приложения.
//   ЗапускатьВФоне - Булево - Если Истина, то запускатель будет запущен в фоновом задании.
//                             Если Ложь, то запускатель будет запущен в текущем потоке.
//   ОжидатьЗавершения - Булево - Если Истина и `ЗапускатьВФоне` = Истина,
//                                то после запуска будет ожидаться его завершение.
//
// Пример:
// &ЗапускательПриложения
// Процедура ПриСозданииОбъекта()
// КонецПроцедуры
//
&Аннотация("ЗапускательПриложения")
&Рогатка
Процедура ПриСозданииОбъекта(&ПсевдонимДля(Аннотация = "Рогатка", Параметр = "Значение") Значение = "", &ПсевдонимДля(Аннотация = "Рогатка", Параметр = "ЗапускатьВФоне") ЗапускатьВФоне = Истина, &ПсевдонимДля(Аннотация = "Рогатка", Параметр = "ОжидатьЗавершения") ОжидатьЗавершения = Истина)

КонецПроцедуры
