// Маркерная аннотация, показывающая, что компонент требует изменений в процессе своего создания.
//
// Параметры аннотации конфликтуют между собой. Если отключаются все обработчики, то нельзя задавать ограничения
// на применение конкретных обработчиков или отключение конкретных обработчиков. Если задано ограничение на
// применение только конкретных обработчиков, то нельзя задавать ограничение на отключение конкретных
// обработчиков (и наоборот).
//
// Размещается над конструктором класса или над фабричным методом.
//
// Примечание: данная аннотация — «душный» псевдоним аннотации `&ОсобоеОбращение` фреймворка autumn.
// Актуальную документацию см. в autumn: https://github.com/autumn-library/autumn
//
// Параметры:
//   ОтключитьВсеОбработчики - Булево - Не применять на компоненте никакие обработчики.
//   ПрименятьТолькоОбработчик - Строка - Повторяемый параметр. Применять на компоненте только обработчик
//                                        с указанным именем.
//   НеПрименятьОбработчик - Строка - Повторяемый параметр. Не применять на компоненте обработчик
//                                    с указанным именем.
//
&Аннотация("ПравилаОбработки")
&ОсобоеОбращение
Процедура ПриСозданииОбъекта(
	&ПсевдонимДля(Аннотация = "ОсобоеОбращение", Параметр = "ОтключитьВсеНапильники") ОтключитьВсеОбработчики = Ложь,
	&Повторяемый &ПсевдонимДля(Аннотация = "ОсобоеОбращение", Параметр = "ПрименятьТолькоНапильник") ПрименятьТолькоОбработчик,
	&Повторяемый &ПсевдонимДля(Аннотация = "ОсобоеОбращение", Параметр = "НеПрименятьНапильник") НеПрименятьОбработчик
)

КонецПроцедуры
