// Помечает указанный класс как фабрику компонентов — конфигурацию, поставляющую компоненты.
// Конфигурация сама по себе тоже является компонентом, то есть может запрашивать внедрение зависимостей,
// является объектом для обработки обработчиками компонентов, может иметь фазу приложения и так далее.
//
// Конфигурация обычно содержит методы, помеченные аннотацией `&ФабричныйМетод`, которые возвращают
// компоненты, но может содержать и другие методы, не связанные непосредственно с созданием компонентов.
//
// Размещается над конструктором класса.
//
// Параметры:
//   Значение - Строка - Имя компонента. По умолчанию будет использовано имя типа объекта,
//                       как оно возвращается функцией `ТипЗнч`.
//
// Пример:
// &Конфигурация
// Процедура ПриСозданииОбъекта()
// КонецПроцедуры
//
// &ФабричныйМетод
// Функция ПользовательскийКомпонент() Экспорт
//     Возврат Новый ПользовательскийКомпонент();
// КонецФункции
//
// Примечание: данная аннотация — «душный» псевдоним аннотации `&Дуб` фреймворка autumn.
// Актуальную документацию см. в autumn: https://github.com/autumn-library/autumn
//
&Аннотация("Конфигурация")
&Дуб
Процедура ПриСозданииОбъекта(&ПсевдонимДля(Аннотация = "Дуб", Параметр = "Значение") Значение = "")

КонецПроцедуры
