// Специальный тип компонента для выполнения дополнительных действий в момент помещения класса
// в контекст приложения.
//
// Может использоваться для добавления динамической загрузки новых классов в систему типов OneScript или
// дополнительных импортов библиотек через директиву `#Использовать`.
//
// Каждый инициализатор приложения дополнительно имеет квалификатор "Заготовка" и фазу приложения "Инициализация".
//
// Компонент, помеченный данной аннотацией, должен реализовать следующий интерфейс:
// * `Процедура ПриИнициализацииПоделки(Поделка) Экспорт`
//
// Размещается над конструктором класса.
//
// Примечание: данная аннотация - «душный» псевдоним аннотации `&Заготовка` фреймворка autumn.
// Актуальную документацию см. в autumn: https://github.com/autumn-library/autumn
//
// Параметры:
//   Значение - Строка - Имя компонента, под которым инициализатор добавляется в контекст приложения.
//
// Пример:
// &ИнициализаторПриложения
// Процедура ПриСозданииОбъекта()
// КонецПроцедуры
//
&Аннотация("ИнициализаторПриложения")
&Заготовка
Процедура ПриСозданииОбъекта(&ПсевдонимДля(Аннотация = "Заготовка", Параметр = "Значение") Значение = "")

КонецПроцедуры
