// Специальный тип компонента для дополнительной обработки других компонентов в процессе их создания.
//
// Каждый обработчик компонента дополнительно имеет квалификатор "Напильник".
//
// Размещается над конструктором класса.
//
// Примечание: данная аннотация - «душный» псевдоним аннотации `&Напильник` фреймворка autumn.
// Актуальную документацию см. в autumn: https://github.com/autumn-library/autumn
//
// Параметры:
//   Значение - Строка - Имя компонента, под которым обработчик добавляется в контекст приложения.
//   ПрименяетсяТолькоНа - Строка - Повторяемый параметр. Ограничивает применение обработчика только
//                                  компонентами с указанным квалификатором.
//
// Пример:
// &ОбработчикКомпонента
// Процедура ПриСозданииОбъекта()
// КонецПроцедуры
//
&Аннотация("ОбработчикКомпонента")
&Напильник
Процедура ПриСозданииОбъекта(&ПсевдонимДля(Аннотация = "Напильник", Параметр = "Значение") Значение = "", &Повторяемый &ПсевдонимДля(Аннотация = "Напильник", Параметр = "ПрименяетсяТолькоНа") ПрименяетсяТолькоНа)

КонецПроцедуры
