// Добавляет к компоненту дополнительный идентификатор, по которому его можно впоследствии получить
// из контейнера. Компонент может иметь несколько квалификаторов. Один и тот же квалификатор может
// использоваться для нескольких компонентов.
//
// Может быть использовано, например, для группировки компонентов и получения их в виде массива.
//
// Размещается над конструктором класса или над фабричным методом.
//
// Примечание: данная аннотация - «душный» псевдоним аннотации `&Прозвище` фреймворка autumn.
// Актуальную документацию см. в autumn: https://github.com/autumn-library/autumn
//
// Параметры:
//   Значение - Строка - Задаваемый квалификатор.
//
// Пример:
// &Квалификатор("ПодписчикНаСобытие")
// &Квалификатор("ПользовательскийКомпонент")
// &Компонент("МойКомпонент")
// Процедура ПриСозданииОбъекта()
// КонецПроцедуры
//
&Аннотация(Значение = "Квалификатор")
&Прозвище("")
Процедура ПриСозданииОбъекта(&ПсевдонимДля(Аннотация = "Прозвище", Параметр = "Значение") Значение)

КонецПроцедуры
